---
type: ParameterValueProvider
namespace: Autodesk.Revit.DB
version: 2024
members: 2
tags: [revit-api, class]
---

# ParameterValueProvider

`Autodesk.Revit.DB.ParameterValueProvider` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ParameterValueProvider | 2011 | `public ParameterValueProvider ( ElementId parameter )` |
| Property | Parameter | 2011 | `public ElementId Parameter { get ; set ; }` |